Repository: orla2025/ScoutHub
Catalog: WebQuizMaster/translations/*/LC_MESSAGES/messages.po
Languages: it

source: ScoutHub - Football Talent Discovery
it: ScoutHub - Scoperta Talenti Calcistici

source: Discover Football Talents
it: Scopri Talenti del Calcio

source: Find and track promising young players all in one place
it: Trova e monitora giovani promesse del calcio in un unico posto

source: Start Scouting
it: Inizia lo Scouting

source: My Players
it: I Miei Giocatori

source: Sign Up Now
it: Registrati Ora

source: Login
it: Accedi

source: Don't have an account?
it: Non hai un account?

source: Register
it: Registrati

source: Username
it: Nome Utente

source: Already have an account?
it: Hai gi√† un account?

source: Features
it: Caratteristiche

source: Video Analysis
it: Analisi Video

source: Upload and analyze performances
it: Carica e analizza le prestazioni

source: Statistics
it: Statistiche

source: Track detailed player statistics
it: Monitora statistiche dettagliate dei giocatori

source: Connect with other scouts
it: Connettiti con altri scout

source: Talent Pool
it: Pool di Talenti

source: Access growing talent database
it: Accedi al database crescente di talenti

source: Football Scout
it: Scout Calcistico

source: Logout
it: Esci

source: Scouting Database
it: Database Scouting

source: Add New Player
it: Aggiungi Nuovo Giocatore
